<a href="https://colab.research.google.com/github/Jenny000327/Database_SQL/blob/main/%E2%80%8D%EC%A0%95%EC%9E%AC%ED%9D%AC%5B%EC%9E%AC%ED%95%99_%EC%A0%84%EC%9E%90%EB%AC%BC%EB%A6%AC%ED%95%99%EA%B3%BC%5D_ch6_homework_2022_dbc_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - SQL2

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름:__________정재희_____________
학번:_______ _201904511_____________
학과:_________전자물리______________
제출일:______2022-12-01________________
```

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 각 10점, 18번 20점, 총200점**

In [ ]:
%load_ext sql

In [ ]:
!pip install pymysql

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 887 kB/s
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

### Use your host, id, password, and database

In [ ]:
import getpass
user = 's201904511'
password = getpass.getpass()
host='dm.hufs.ac.kr'
database = 's201904511db'
connection_string = f'mysql+pymysql://{user}:{password}@{host}:3306/{database}'
    
%sql $connection_string

··········

'Connected: s201904511@s201904511db'

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab"

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

### 1-13번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

In [ ]:
%%sql
/* YOUR CODE HERE */
/**/ :10점
SELECT DISTINCT CONCAT(e.Fname, " ",e.Minit,". ",e.Lname) as "Employee name"
from EMPLOYEE e, PROJECT pr, WORKS_ON wo
WHERE e.dno = 5
  AND pr.Pname = "ProductX"
  AND pr.Pnumber = wo.Pno
  AND wo.Hours >= 10
  AND wo.Essn = e.ssn;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
2 rows affected.

[('John B. Smith',), ('Joyce A. English',)]


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)

In [ ]:
%%sql
/**/ :10점
SELECT CONCAT(e.Fname, " ",e.Minit,". ",e.Lname) AS "Employee name"
FROM EMPLOYEE e
WHERE EXISTS(
    SELECT * FROM DEPENDENT de
    WHERE e.ssn = de.essn AND e.sex = de.sex
);

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
2 rows affected.

[('John B. Smith',), ('Franklin T. Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)

In [ ]:
%%sql
/**/ :10점
SELECT CONCAT(e.Fname, " ",e.Minit,". ",e.Lname) AS "Employee name"
FROM EMPLOYEE e
WHERE EXISTS (
    SELECT * FROM EMPLOYEE se
    WHERE e.superssn = se.ssn
      AND se.Fname = "Franklin"
      AND se.Lname = "Wong"
)

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
3 rows affected.

[('John B. Smith',), ('Joyce A. English',), ('Ramesh K. Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [ ]:
%%sql
/**/ :10점
SELECT p.Pname AS "Project name", SUM(Hours) AS "Total hours"
FROM PROJECT p, WORKS_ON wo
WHERE p.pnumber = wo.pno
GROUP BY wo.pno, p.Pname
ORDER BY SUM(Hours) DESC;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
6 rows affected.

[('Newbenefits', Decimal('55.0')),
 ('Computerization', Decimal('55.0')),
 ('ProductX', Decimal('52.5')),
 ('ProductZ', Decimal('50.0')),
 ('ProductY', Decimal('37.5')),
 ('Reorganization', Decimal('25.0'))]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.

In [ ]:
%%sql
/**/ :10점
SELECT CONCAT(e.Fname, " ",e.Minit,". ",e.Lname) AS "Employee name"
FROM EMPLOYEE e
WHERE NOT EXISTS (
    SELECT * FROM PROJECT p, DEPARTMENT d
    WHERE d.dname = "Administration"
      AND d.dnumber = p.dnum
      AND NOT EXISTS(
        SELECT * FROM WORKS_ON wo
        WHERE e.ssn =wo.essn
          AND p.pnumber = wo.pno
      )
);

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
2 rows affected.

[('Ahmad V. Jabbar',), ('Alicia J. Zelaya',)]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)

In [ ]:
%%sql
/**/ :10점
SELECT CONCAT(e.Fname, " ",e.Minit,". ",e.Lname) AS "Employee name"
FROM EMPLOYEE e
WHERE NOT EXISTS (
    SELECT * FROM PROJECT p, WORKS_ON wo
    WHERE p.Plocation = "Houston"
      AND p.Pnumber = wo. Pno
      AND e.ssn = wo.essn 
);

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
4 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만(버림) 출력, Refer to MySQL manual or  Googling)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [ ]:
%%sql
/**/ :10점
SELECT de.dname AS "Department name", TRUNCATE(AVG(e.salary),2) AS "Average salary"
FROM EMPLOYEE e, DEPARTMENT de
WHERE e.dno = de. dnumber
GROUP BY e.dno
ORDER BY TRUNCATE(AVG(e.salary),2) DESC;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
3 rows affected.

[('Headquarters', Decimal('55000.00')),
 ('Research', Decimal('33250.00')),
 ('Administration', Decimal('31000.00'))]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만(버림) 출력, Refer to MySQL manual or  Googling)
Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [ ]:
%%sql
/**/ :10점
SELECT TRUNCATE(AVG(e.salary),2) AS "Average salary" 
FROM EMPLOYEE e
WHERE e.sex ="F";

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
1 rows affected.

[(Decimal('31000.00'),)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [ ]:
%%sql
/**/ :10점
SELECT CONCAT(e.Fname," ",e.Minit,". ",e.Lname  ) as "Employee name",
       e.address as "Address"
FROM EMPLOYEE e
WHERE EXISTS(
    SELECT wo.essn FROM PROJECT p, WORKS_ON wo
    WHERE p.PLOCATION = "Houston"
      AND p.Pnumber = wo.Pno
      AND e.ssn = wo.essn
)
AND NOT EXISTS(
    SELECT e.ssn FROM DEPT_LOCATIONS dl
    WHERE dl.dlocation = "Houston"
      AND dl.dnumber = e.dno
);

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
1 rows affected.

[('Jennifer S. Wallace', '291-Berry-Bellaire-TX')]

#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

In [ ]:
%%sql
/**/ :10점
select CONCAT(e.Fname," ",e.Minit,". ",e.Lname  ) as "Employee name" 
from EMPLOYEE e
WHERE NOT EXISTS(
    SELECT * FROM DEPENDENT de
    WHERE e.ssn = de.essn
);

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
5 rows affected.

[('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('James E. Borg',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

In [ ]:
%%sql
/**/ :10점
SELECT CONCAT(e.Fname, " ", e.Minit, ". ",e.Lname) AS "Employee name"
FROM EMPLOYEE e
WHERE e.dno= (
    SELECT e1.dno FROM EMPLOYEE e1
    WHERE NOT EXISTS(
        SELECT * FROM EMPLOYEE e2
        WHERE e2.Salary>e1.Salary
    ) 
);

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
1 rows affected.

[('James E. Borg',)]

#### 12-1. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

In [ ]:
%%sql
/**/ :10점
SELECT CONCAT(e.Fname," ",e.Minit,". ",e.Lname  ) AS "Employee name" 
FROM EMPLOYEE e
WHERE EXISTS(
      SELECT * FROM EMPLOYEE e1
      WHERE EXISTS(
            SELECT * FROM EMPLOYEE e2
            WHERE e2.Fname = "James" AND e2.Lname = "Borg"
              AND e2.ssn = e1.Superssn
      )
        AND e1.ssn = e.Superssn
);

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 12-2. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

In [ ]:
%%sql
/**/ :10점
SELECT CONCAT(e.Fname," ",e.Minit,". ",e.Lname  ) AS "Employee name" 
FROM EMPLOYEE e, EMPLOYEE se, EMPLOYEE sse
WHERE sse.Fname = "James" 
    AND sse.Lname = "Borg"
    AND sse.ssn = se.Superssn
    AND se.ssn = e.Superssn;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
5 rows affected.

[('John B. Smith',),
 ('Joyce A. English',),
 ('Ramesh K. Narayan',),
 ('Ahmad V. Jabbar',),
 ('Alicia J. Zelaya',)]

#### 13. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

In [ ]:
%%sql
/**/ :10점
SELECT DISTINCT CONCAT(e.Fname," ",e.Minit, ". ",e.Lname) AS "Employee name"
FROM EMPLOYEE e,
    (SELECT * FROM EMPLOYEE e1
     WHERE e1.Salary <= all(SELECT e1.Salary FROM EMPLOYEE e1)) AS min_sal_emp
WHERE min_sal_emp.Salary + 10000 <= e.Salary;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
4 rows affected.

[('Franklin T. Wong',),
 ('Ramesh K. Narayan',),
 ('James E. Borg',),
 ('Jennifer S. Wallace',)]

### 14-17번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 14. A view that has the department name, manager name, and manager salary for every department

In [ ]:
%%sql
/**/ :10점
CREATE VIEW DEPT_VIEW AS
		SELECT d.dname AS "Department Name",
			     CONCAT(e.Fname," ",e.Minit,". ",e.Lname  ) AS "Manager Name",
           e.salary AS "Manager Salary"
		FROM EMPLOYEE e, DEPARTMENT d
    WHERE e.ssn = d.Mgrssn;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
0 rows affected.

[]

In [ ]:
%sql select * from DEPT_VIEW;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
3 rows affected.

[('Headquarters', 'James E. Borg', Decimal('55000.00')),
 ('Administration', 'Jennifer S. Wallace', Decimal('43000.00')),
 ('Research', 'Franklin T. Wong', Decimal('40000.00'))]

#### 15. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

In [ ]:
%%sql
/**/ :10점
CREATE VIEW RESEARCH_DEPT_VIEW AS
		SELECT CONCAT(e.Fname," ",e.Minit,". ",e.Lname  ) as "Employee name",
			     CONCAT(se.Fname," ",se.Minit,". ",se.Lname  ) as "Supervisor name",
			     e.salary AS "Employee salary"
    FROM EMPLOYEE e, EMPLOYEE se, DEPARTMENT de 
		WHERE e.superssn = se.ssn
		  AND de.dname = "Research"
		  AND e.dno = de.Dnumber;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
0 rows affected.

[]

In [ ]:
%sql select * from RESEARCH_DEPT_VIEW;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
4 rows affected.

[('John B. Smith', 'Franklin T. Wong', Decimal('30000.00')),
 ('Franklin T. Wong', 'James E. Borg', Decimal('40000.00')),
 ('Joyce A. English', 'Franklin T. Wong', Decimal('25000.00')),
 ('Ramesh K. Narayan', 'Franklin T. Wong', Decimal('38000.00'))]

#### 16. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

In [ ]:
%%sql
/**/ :10점
CREATE VIEW PROJECT_VIEW AS
			SELECT p.pname AS "Project Name",
				     d.dname  AS "Department Name",
				     COUNT(wo.essn) AS "number of employees",
				     SUM(wo.Hours) AS "Total Hours" 
			FROM PROJECT p, DEPARTMENT d, WORKS_ON wo 
      WHERE d.dnumber = p.dnum
			  AND p.Pnumber = wo.Pno
			GROUP BY p.pname;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
0 rows affected.

[]

In [ ]:
%sql select * from PROJECT_VIEW;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
6 rows affected.

[('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

In [ ]:
%%sql
/**/ :10점
CREATE VIEW PROJECT_VIEW_GT2 AS
      SELECT p.pname AS "Project Name",
             d.dname  AS "Department Name",
             COUNT(wo.essn) AS "number of employees",
             SUM(wo.Hours) AS "Total Hours" 
      FROM PROJECT p, DEPARTMENT d, WORKS_ON wo 
      WHERE d.dnumber = p.dnum
        AND p.Pnumber = wo.Pno
      GROUP BY p.pname
      HAVING COUNT(wo.essn) >= 2;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
0 rows affected.

[]

In [ ]:
%sql select * from PROJECT_VIEW_GT2;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
6 rows affected.

[('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 18. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 18번 문제 Update 한 후에 1-17번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-17번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [ ]:
%%sql

CREATE TABLE salary_audit (
  ssn char(9),
  before_salary decimal(10,2),
  after_salary decimal(10,2),
  udatetime datetime
);

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
0 rows affected.

[]

In [ ]:
%%sql

CREATE TRIGGER salary_audit_tring
AFTER UPDATE
ON EMPLOYEE
FOR EACH ROW
BEGIN 
IF new.salary <> old.salary THEN
	INSERT INTO salary_audit VALUES (new.ssn, old.salary, new.salary, now());
END IF;
END

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
0 rows affected.

[]

In [ ]:
%sql select * from salary_audit;/**/ :10점

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
0 rows affected.

[]

In [ ]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
4 rows affected.

[]

In [ ]:
%sql select * from salary_audit;/**/ :10점

 * mysql+pymysql://s201904511:***@dm.hufs.ac.kr:3306/s201904511db
4 rows affected.

[('123456789', Decimal('30000.00'), Decimal('60000.00'), datetime.datetime(2022, 12, 1, 22, 59, 32)),
 ('333445555', Decimal('40000.00'), Decimal('80000.00'), datetime.datetime(2022, 12, 1, 22, 59, 32)),
 ('453453453', Decimal('25000.00'), Decimal('50000.00'), datetime.datetime(2022, 12, 1, 22, 59, 32)),
 ('666884444', Decimal('38000.00'), Decimal('76000.00'), datetime.datetime(2022, 12, 1, 22, 59, 32))]